### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-auth-lambda"
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:21",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:17" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:17/invocations" -> (known after apply)
        tags                           = {
            "Deployment" = "terraform"
        }
!       version                        = "17" -> (known after apply)
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "17" -> (known after apply)
!       source_arn          = "arn:aws:execute-api:us-east-1:350131064538:syvh7hov93/*/*" -> "arn:aws:execute-api:us-east-1:350131064538:syvh7hov93/*/*/*"
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "unqualified_alias_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       source_arn          = "arn:aws:execute-api:us-east-1:350131064538:syvh7hov93/*/*" -> "arn:aws:execute-api:us-east-1:350131064538:syvh7hov93/*/*/*"
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "8878441974432986140" -> (known after apply)
!       triggers = {
!           "timestamp" = "1691816555637682000" -> "1691856684245534000"
            # (1 unchanged element hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:21" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-12T05:03:34.349+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:21" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3" -> (known after apply)
!       s3_key                      = "builds/3416dea8bc556d3a0802620b199bb71ca32a9e56cc499ac5b58736bf27c10378.zip" -> "builds/7d1de49a1f22d7fcceee0f34a8c9c7faf2c6c3b4482daa13581dd61f56678921.zip"
!       s3_object_version           = "znx.DgtFL184O0PY5IZ_J1OWgbjlbycS" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "PuF91+MZb8TSXI0+4J6Z2ScicGUteNFO8o5fFWu520I=" -> (known after apply)
!       source_code_size            = 26186328 -> (known after apply)
!       version                     = "21" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "d27f775c088b4861710e7074d858cf4d-5" -> (known after apply)
!       id                     = "builds/3416dea8bc556d3a0802620b199bb71ca32a9e56cc499ac5b58736bf27c10378.zip" -> (known after apply)
!       key                    = "builds/3416dea8bc556d3a0802620b199bb71ca32a9e56cc499ac5b58736bf27c10378.zip" -> "builds/7d1de49a1f22d7fcceee0f34a8c9c7faf2c6c3b4482daa13581dd61f56678921.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/3416dea8bc556d3a0802620b199bb71ca32a9e56cc499ac5b58736bf27c10378.zip" -> "builds/7d1de49a1f22d7fcceee0f34a8c9c7faf2c6c3b4482daa13581dd61f56678921.zip"
-       tags                   = {} -> null
!       tags_all               = {} -> (known after apply)
!       version_id             = "znx.DgtFL184O0PY5IZ_J1OWgbjlbycS" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "dist",
+                       null,
                    ],
                ]
+               filename      = "builds/7d1de49a1f22d7fcceee0f34a8c9c7faf2c6c3b4482daa13581dd61f56678921.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/7d1de49a1f22d7fcceee0f34a8c9c7faf2c6c3b4482daa13581dd61f56678921.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "2848157292146813458" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/3416dea8bc556d3a0802620b199bb71ca32a9e56cc499ac5b58736bf27c10378.zip" -> "builds/7d1de49a1f22d7fcceee0f34a8c9c7faf2c6c3b4482daa13581dd61f56678921.zip"
!           "timestamp" = "1691816557258644200" -> "1691856685736176000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "6482286640968701566" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/3416dea8bc556d3a0802620b199bb71ca32a9e56cc499ac5b58736bf27c10378.zip" -> "builds/7d1de49a1f22d7fcceee0f34a8c9c7faf2c6c3b4482daa13581dd61f56678921.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 8 to add, 1 to change, 7 to destroy.
```
</details>